; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-8-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p0-5 - location
	p2-1 - location
	p2-3 - location
	p2-6 - location
	p3-4 - location
	p4-0 - location
	p6-1 - location
	p6-2 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s3)
	(at driver3 s4)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s5)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at truck7 s4)
	(empty truck7)
	(at truck8 s6)
	(empty truck8)
	(at package1 s4)
	(at package2 s5)
	(at package3 s0)
	(at package4 s2)
	(at package5 s5)
	(at package6 s5)
	(at package7 s0)
	(at package8 s1)
	(at package9 s0)
	(at package10 s2)
	(at package11 s3)
	(at package12 s4)
	(at package13 s6)
	(at package14 s0)
	(at package15 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 55)
	(= (time-to-walk p0-1 s0) 55)
	(= (time-to-walk s1 p0-1) 86)
	(= (time-to-walk p0-1 s1) 86)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 37)
	(= (time-to-walk p0-2 s0) 37)
	(= (time-to-walk s2 p0-2) 76)
	(= (time-to-walk p0-2 s2) 76)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 98)
	(= (time-to-walk p0-3 s0) 98)
	(= (time-to-walk s3 p0-3) 51)
	(= (time-to-walk p0-3 s3) 51)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 88)
	(= (time-to-walk p0-5 s0) 88)
	(= (time-to-walk s5 p0-5) 19)
	(= (time-to-walk p0-5 s5) 19)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 25)
	(= (time-to-walk p2-1 s2) 25)
	(= (time-to-walk s1 p2-1) 23)
	(= (time-to-walk p2-1 s1) 23)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 20)
	(= (time-to-walk p2-3 s2) 20)
	(= (time-to-walk s3 p2-3) 70)
	(= (time-to-walk p2-3 s3) 70)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 72)
	(= (time-to-walk p2-6 s2) 72)
	(= (time-to-walk s6 p2-6) 62)
	(= (time-to-walk p2-6 s6) 62)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 13)
	(= (time-to-walk p3-4 s3) 13)
	(= (time-to-walk s4 p3-4) 77)
	(= (time-to-walk p3-4 s4) 77)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 11)
	(= (time-to-walk p4-0 s4) 11)
	(= (time-to-walk s0 p4-0) 27)
	(= (time-to-walk p4-0 s0) 27)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 84)
	(= (time-to-walk p6-1 s6) 84)
	(= (time-to-walk s1 p6-1) 78)
	(= (time-to-walk p6-1 s1) 78)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 21)
	(= (time-to-drive s3 s0) 21)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 62)
	(= (time-to-drive s6 s0) 62)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 70)
	(= (time-to-drive s2 s1) 70)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 20)
	(= (time-to-drive s3 s1) 20)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 68)
	(= (time-to-drive s3 s2) 68)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 78)
	(= (time-to-drive s5 s2) 78)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 47)
	(= (time-to-drive s6 s2) 47)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 47)
	(= (time-to-drive s0 s4) 47)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 87)
	(= (time-to-drive s1 s4) 87)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 53)
	(= (time-to-drive s0 s5) 53)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 49)
	(= (time-to-drive s3 s5) 49)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 42)
	(= (time-to-drive s4 s5) 42)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 38)
	(= (time-to-drive s1 s6) 38)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 86)
	(= (time-to-drive s3 s6) 86)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 17)
	(= (time-to-drive s5 s6) 17)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s4)
	(at truck2 s6)
	(at truck4 s5)
	(at truck6 s1)
	(at truck7 s0)
	(at package1 s0)
	(at package2 s5)
	(at package3 s1)
	(at package5 s1)
	(at package6 s2)
	(at package7 s0)
	(at package8 s5)
	(at package9 s3)
	(at package10 s3)
	(at package11 s0)
	(at package12 s6)
	(at package13 s6)
	(at package14 s1)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 2  (driven))) (* 1  (walked))))

)

; plan
1. (board-truck driver2 truck2 s3)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 3 of 18
2. (walk driver1 s3 p3-4)
   deleted: (at driver1 s3)
   added: (at driver1 p3-4)
   changed: (walked) from 0 to 13
   goals met: 3 of 18
3. (load-truck package1 truck7 s4)
   deleted: (at package1 s4)
   added: (in package1 truck7)
   goals met: 3 of 18
4. (board-truck driver3 truck7 s4)
   deleted: (at driver3 s4) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 3 of 18
5. (walk driver1 p3-4 s4)
   deleted: (at driver1 p3-4)
   added: (at driver1 s4)
   changed: (walked) from 13 to 90
   goals met: 4 of 18
6. (load-truck package11 truck2 s3)
   deleted: (at package11 s3)
   added: (in package11 truck2)
   goals met: 4 of 18
7. (load-truck package12 truck7 s4)
   deleted: (at package12 s4)
   added: (in package12 truck7)
   goals met: 4 of 18
8. (drive-truck truck2 s3 s6 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s6)
   changed: (driven) from 0 to 86
   goals met: 5 of 18
9. (drive-truck truck7 s4 s0 driver3)
   deleted: (at truck7 s4)
   added: (at truck7 s0)
   changed: (driven) from 86 to 133
   goals met: 6 of 18
10. (load-truck package9 truck7 s0)
   deleted: (at package9 s0)
   added: (in package9 truck7)
   goals met: 6 of 18
11. (unload-truck package1 truck7 s0)
   deleted: (in package1 truck7)
   added: (at package1 s0)
   goals met: 7 of 18
12. (disembark-truck driver3 truck7 s0)
   deleted: (driving driver3 truck7)
   added: (at driver3 s0) (empty truck7)
   goals met: 7 of 18
13. (drive-truck truck2 s6 s0 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (driven) from 133 to 195
   goals met: 6 of 18
14. (unload-truck package12 truck7 s0)
   deleted: (in package12 truck7)
   added: (at package12 s0)
   goals met: 6 of 18
15. (load-truck package12 truck2 s0)
   deleted: (at package12 s0)
   added: (in package12 truck2)
   goals met: 6 of 18
16. (load-truck package3 truck2 s0)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   goals met: 6 of 18
17. (unload-truck package11 truck2 s0)
   deleted: (in package11 truck2)
   added: (at package11 s0)
   goals met: 7 of 18
18. (unload-truck package9 truck7 s0)
   deleted: (in package9 truck7)
   added: (at package9 s0)
   goals met: 7 of 18
19. (load-truck package9 truck2 s0)
   deleted: (at package9 s0)
   added: (in package9 truck2)
   goals met: 7 of 18
20. (load-truck package14 truck2 s0)
   deleted: (at package14 s0)
   added: (in package14 truck2)
   goals met: 7 of 18
21. (drive-truck truck2 s0 s6 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (driven) from 195 to 257
   goals met: 8 of 18
22. (unload-truck package12 truck2 s6)
   deleted: (in package12 truck2)
   added: (at package12 s6)
   goals met: 9 of 18
23. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 9 of 18
24. (drive-truck truck4 s0 s5 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s5)
   changed: (driven) from 257 to 310
   goals met: 10 of 18
25. (load-truck package6 truck4 s5)
   deleted: (at package6 s5)
   added: (in package6 truck4)
   goals met: 10 of 18
26. (board-truck driver1 truck6 s4)
   deleted: (at driver1 s4) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 9 of 18
27. (drive-truck truck2 s6 s3 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   changed: (driven) from 310 to 396
   goals met: 8 of 18
28. (unload-truck package9 truck2 s3)
   deleted: (in package9 truck2)
   added: (at package9 s3)
   goals met: 9 of 18
29. (drive-truck truck2 s3 s1 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (driven) from 396 to 416
   goals met: 9 of 18
30. (unload-truck package3 truck2 s1)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   goals met: 10 of 18
31. (unload-truck package14 truck2 s1)
   deleted: (in package14 truck2)
   added: (at package14 s1)
   goals met: 11 of 18
32. (drive-truck truck4 s5 s2 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s2)
   changed: (driven) from 416 to 494
   goals met: 10 of 18
33. (drive-truck truck2 s1 s6 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (driven) from 494 to 532
   goals met: 11 of 18
34. (unload-truck package6 truck4 s2)
   deleted: (in package6 truck4)
   added: (at package6 s2)
   goals met: 12 of 18
35. (load-truck package10 truck4 s2)
   deleted: (at package10 s2)
   added: (in package10 truck4)
   goals met: 12 of 18
36. (drive-truck truck4 s2 s3 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   changed: (driven) from 532 to 600
   goals met: 12 of 18
37. (unload-truck package10 truck4 s3)
   deleted: (in package10 truck4)
   added: (at package10 s3)
   goals met: 13 of 18
38. (drive-truck truck4 s3 s5 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s5)
   changed: (driven) from 600 to 649
   goals met: 14 of 18
39. (drive-truck truck6 s4 s1 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   changed: (driven) from 649 to 736
   goals met: 15 of 18
40. (load-truck package8 truck6 s1)
   deleted: (at package8 s1)
   added: (in package8 truck6)
   goals met: 15 of 18
41. (drive-truck truck6 s1 s4 driver1)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   changed: (driven) from 736 to 823
   goals met: 14 of 18
42. (drive-truck truck2 s6 s1 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (driven) from 823 to 861
   goals met: 13 of 18
43. (drive-truck truck6 s4 s5 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   changed: (driven) from 861 to 903
   goals met: 13 of 18
44. (unload-truck package8 truck6 s5)
   deleted: (in package8 truck6)
   added: (at package8 s5)
   goals met: 14 of 18
45. (drive-truck truck6 s5 s4 driver1)
   deleted: (at truck6 s5)
   added: (at truck6 s4)
   changed: (driven) from 903 to 945
   goals met: 14 of 18
46. (drive-truck truck2 s1 s6 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (driven) from 945 to 983
   goals met: 15 of 18
47. (drive-truck truck6 s4 s1 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   changed: (driven) from 983 to 1070
   goals met: 16 of 18
48. (drive-truck truck2 s6 s5 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   changed: (driven) from 1070 to 1087
   goals met: 15 of 18
49. (load-truck package5 truck2 s5)
   deleted: (at package5 s5)
   added: (in package5 truck2)
   goals met: 15 of 18
50. (drive-truck truck6 s1 s4 driver1)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   changed: (driven) from 1087 to 1174
   goals met: 14 of 18
51. (drive-truck truck6 s4 s5 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   changed: (driven) from 1174 to 1216
   goals met: 14 of 18
52. (drive-truck truck2 s5 s6 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   changed: (driven) from 1216 to 1233
   goals met: 15 of 18
53. (drive-truck truck6 s5 s6 driver1)
   deleted: (at truck6 s5)
   added: (at truck6 s6)
   changed: (driven) from 1233 to 1250
   goals met: 15 of 18
54. (drive-truck truck2 s6 s1 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (driven) from 1250 to 1288
   goals met: 14 of 18
55. (unload-truck package5 truck2 s1)
   deleted: (in package5 truck2)
   added: (at package5 s1)
   goals met: 15 of 18
56. (drive-truck truck2 s1 s6 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (driven) from 1288 to 1326
   goals met: 16 of 18
57. (disembark-truck driver1 truck6 s6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s6) (empty truck6)
   goals met: 16 of 18
58. (disembark-truck driver2 truck2 s6)
   deleted: (driving driver2 truck2)
   added: (at driver2 s6) (empty truck2)
   goals met: 16 of 18
59. (board-truck driver2 truck6 s6)
   deleted: (at driver2 s6) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 16 of 18
60. (drive-truck truck6 s6 s1 driver2)
   deleted: (at truck6 s6)
   added: (at truck6 s1)
   changed: (driven) from 1326 to 1364
   goals met: 17 of 18
61. (disembark-truck driver2 truck6 s1)
   deleted: (driving driver2 truck6)
   added: (at driver2 s1) (empty truck6)
   goals met: 17 of 18
62. (disembark-truck driver3 truck4 s5)
   deleted: (driving driver3 truck4)
   added: (at driver3 s5) (empty truck4)
   goals met: 17 of 18
63. (board-truck driver1 truck8 s6)
   deleted: (at driver1 s6) (empty truck8)
   added: (driving driver1 truck8)
   goals met: 17 of 18
64. (drive-truck truck8 s6 s5 driver1)
   deleted: (at truck8 s6)
   added: (at truck8 s5)
   changed: (driven) from 1364 to 1381
   goals met: 17 of 18
65. (drive-truck truck8 s5 s4 driver1)
   deleted: (at truck8 s5)
   added: (at truck8 s4)
   changed: (driven) from 1381 to 1423
   goals met: 17 of 18
66. (disembark-truck driver1 truck8 s4)
   deleted: (driving driver1 truck8)
   added: (at driver1 s4) (empty truck8)
   goals met: 18 of 18
